Model: "Block_III"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Ra_number (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
Pr_number (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
4_nodes_hidden_layer_1 (Dense)  (None, 4)            8           Ra_number[0][0]                  
__________________________________________________________________________________________________
4_nodes_hidden_layer_4 (Dense)  (None, 4)            8           Pr_number[0][0]                  
__________________________________________________________________________________________________
16_nodes_hidden_layer_2 (Dense) (None, 16)           80          4_nodes_hidden_layer_1[0][0]     
__________________________________________________________________________________________________
16_nodes_hidden_layer_5 (Dense) (None, 16)           80          4_nodes_hidden_layer_4[0][0]     
__________________________________________________________________________________________________
16_nodes_hidden_layer_3 (Dense) (None, 16)           272         16_nodes_hidden_layer_2[0][0]    
__________________________________________________________________________________________________
16_nodes_hidden_layer_6 (Dense) (None, 16)           272         16_nodes_hidden_layer_5[0][0]    
__________________________________________________________________________________________________
Nu_Ra_ (Dense)                  (None, 1)            17          16_nodes_hidden_layer_3[0][0]    
__________________________________________________________________________________________________
Nu_Pr_ (Dense)                  (None, 1)            17          16_nodes_hidden_layer_6[0][0]    
__________________________________________________________________________________________________
Nu_Ra__Nu_Pr__ (Concatenate)    (None, 2)            0           Nu_Ra_[0][0]                     
                                                                 Nu_Pr_[0][0]                     
__________________________________________________________________________________________________
16_nodes_hidden_layer_7 (Dense) (None, 16)           48          Nu_Ra__Nu_Pr__[0][0]             
__________________________________________________________________________________________________
16_nodes_hidden_layer_8 (Dense) (None, 16)           272         16_nodes_hidden_layer_7[0][0]    
__________________________________________________________________________________________________
output_Nu_number (Dense)        (None, 1)            17          16_nodes_hidden_layer_8[0][0]    
==================================================================================================
Total params: 1,091
Trainable params: 337
Non-trainable params: 754
__________________________________________________________________________________________________
--- the Test loss is [2.388263055763673e-05, 0.003081883303821087]
--- mean relative error: 0.71%, standard deviation of relative error: 0.89%
the best train loss is 1.0331384601158788e-06

 Checking the train dataset through the final model:
--- the Train loss is [1.4233028196031228e-06, 0.0004771796229761094]
--- mean relative error: 0.11%, standard deviation of relative error: 0.25%
--- the Validation loss is [1.0331384601158788e-06, 0.0005021400866098702]
--- mean relative error: 0.12%, standard deviation of relative error: 0.20%
--- the Train_all loss is [1.5438653235833044e-06, 0.000527101568877697]
--- mean relative error: 0.12%, standard deviation of relative error: 0.26%
The total runtime was 213.92 minutes.
