Model: "Block_III"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Ra_number (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
Pr_number (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
4_nodes_hidden_layer_1 (Dense)  (None, 4)            8           Ra_number[0][0]                  
__________________________________________________________________________________________________
4_nodes_hidden_layer_4 (Dense)  (None, 4)            8           Pr_number[0][0]                  
__________________________________________________________________________________________________
16_nodes_hidden_layer_2 (Dense) (None, 16)           80          4_nodes_hidden_layer_1[0][0]     
__________________________________________________________________________________________________
16_nodes_hidden_layer_5 (Dense) (None, 16)           80          4_nodes_hidden_layer_4[0][0]     
__________________________________________________________________________________________________
16_nodes_hidden_layer_3 (Dense) (None, 16)           272         16_nodes_hidden_layer_2[0][0]    
__________________________________________________________________________________________________
16_nodes_hidden_layer_6 (Dense) (None, 16)           272         16_nodes_hidden_layer_5[0][0]    
__________________________________________________________________________________________________
Nu_Ra_ (Dense)                  (None, 1)            17          16_nodes_hidden_layer_3[0][0]    
__________________________________________________________________________________________________
Nu_Pr_ (Dense)                  (None, 1)            17          16_nodes_hidden_layer_6[0][0]    
__________________________________________________________________________________________________
Nu_Ra__Nu_Pr__ (Concatenate)    (None, 2)            0           Nu_Ra_[0][0]                     
                                                                 Nu_Pr_[0][0]                     
__________________________________________________________________________________________________
16_nodes_hidden_layer_7 (Dense) (None, 16)           48          Nu_Ra__Nu_Pr__[0][0]             
__________________________________________________________________________________________________
16_nodes_hidden_layer_8 (Dense) (None, 16)           272         16_nodes_hidden_layer_7[0][0]    
__________________________________________________________________________________________________
output_Nu_number (Dense)        (None, 1)            17          16_nodes_hidden_layer_8[0][0]    
==================================================================================================
Total params: 1,091
Trainable params: 337
Non-trainable params: 754
__________________________________________________________________________________________________
--- the Test loss is [1.1705737961165141e-05, 0.001932763960212469]
--- mean relative error: 0.45%, standard deviation of relative error: 0.66%
the best train loss is 3.5577227208705153e-07

 Checking the train dataset through the final model:
--- the Train loss is [1.291501689593133e-06, 0.0005174928228370845]
--- mean relative error: 0.12%, standard deviation of relative error: 0.23%
--- the Validation loss is [3.5577227208705153e-07, 0.0004274302045814693]
--- mean relative error: 0.10%, standard deviation of relative error: 0.10%
--- the Train_all loss is [1.1695465218508616e-06, 0.0005109921912662685]
--- mean relative error: 0.12%, standard deviation of relative error: 0.22%
The total runtime was 163.04 minutes.
